In [1]:
import pandas as pd

In [2]:
rating = pd.read_csv('/Users/blakemyers/Desktop/Jupyter/ml-latest-small/ratings.csv', error_bad_lines=False, encoding='latin-1')

In [3]:
rating.head(3)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224

In [4]:
rating["rating"] = 2 * rating["rating"]

In [5]:
rating.head(3)

   userId  movieId  rating  timestamp
0       1        1     8.0  964982703
1       1        3     8.0  964981247
2       1        6     8.0  964982224

In [6]:
movie = pd.read_csv("/Users/blakemyers/Desktop/Jupyter/ml-latest-small/movies.csv", error_bad_lines=False, encoding='latin-1')

In [7]:
movie.head(3)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance

In [8]:
movie_rating = pd.merge(rating, movie, on = 'movieId')

In [9]:
movie_rating.head(3)

,userId,movieId,rating,timestamp,title,genres
0,1,1,8.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,5,1,8.0,847434962,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,7,1,9.0,1106635946,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy

In [10]:
cols = ['timestamp']

In [11]:
movie_rating.drop(cols, axis=1, inplace=True)

In [12]:
movie_rating.head(3)

,userId,movieId,rating,title,genres
0,1,1,8.0,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,5,1,8.0,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,7,1,9.0,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy

In [13]:
numrate_movie = movie_rating.groupby("title")["rating"].count().reset_index()

In [14]:
numrate_movie.head(3)

                                     title  rating
0                               '71 (2014)       1
1  'Hellboy': The Seeds of Creation (2004)       1
2                   'Round Midnight (1986)       2

In [15]:
numrate_movie.rename({"rating": "ratecount_movie"}, axis=1, inplace=True)

In [16]:
numrate_movie.head(3)

                                     title  ratecount_movie
0                               '71 (2014)                1
1  'Hellboy': The Seeds of Creation (2004)                1
2                   'Round Midnight (1986)                2

In [17]:
numrate_movie = numrate_movie.query("ratecount_movie >= 20")

In [18]:
numrate_movie.head(3)

                                title  ratecount_movie
8         (500) Days of Summer (2009)               42
18  10 Things I Hate About You (1999)               54
23              101 Dalmatians (1996)               47

In [19]:
ratings20plus = pd.merge(numrate_movie, movie_rating, on = 'title', how = 'inner')

In [20]:
ratings20plus.head(3)

,title,ratecount_movie,userId,movieId,rating,genres
0,(500) Days of Summer (2009),42,15,69757,8.0,Comedy|Drama|Romance
1,(500) Days of Summer (2009),42,18,69757,8.0,Comedy|Drama|Romance
2,(500) Days of Summer (2009),42,22,69757,1.0,Comedy|Drama|Romance

In [21]:
numrate_user = ratings20plus.groupby("userId")["rating"].count().reset_index()

In [22]:
numrate_user.head(3)

   userId  rating
0       1     181
1       2      23
2       3      22

In [23]:
numrate_user.rename({"rating": "ratecount_user"}, axis=1, inplace=True)

In [24]:
numrate_user.head(3)

   userId  ratecount_user
0       1             181
1       2              23
2       3              22

In [25]:
numrate_user = numrate_user.query("ratecount_user >= 20")

In [26]:
ur20plus = pd.merge(ratings20plus, numrate_user, on = "userId", how = "inner")

In [27]:
ur20plus.head(5)

,title,ratecount_movie,userId,movieId,rating,genres,ratecount_user
0,(500) Days of Summer (2009),42,15,69757,8.0,Comedy|Drama|Romance,122
1,101 Dalmatians (One Hundred and One Dalmatians...,44,15,2085,3.0,Adventure|Animation|Children,122
2,28 Days Later (2002),58,15,6502,7.0,Action|Horror|Sci-Fi,122
3,A.I. Artificial Intelligence (2001),56,15,4370,8.0,Adventure|Drama|Sci-Fi,122
4,"Adjustment Bureau, The (2011)",21,15,84954,9.0,Romance|Sci-Fi|Thriller,122

In [28]:
# Next stages:
    # finish the final steps of preprocessing the data
    # build ML model using tensorflow
    # begin training ML model on data